authlogic/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    session[:return_to] = request.referer
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def edit
    session[:return_to] = request.referer
    @user = User.find(params[:id])

INSERT INTO "users" ("login", "email", "crypted_password", "password_salt", "persistence_token", "about", "avatar_file_name", "created_at", "updated_at", "oauth_token", "oauth_secret") VALUES ('example', 'example@example.com', '60ded810103ce246480dfe6d871725bbec503bdb1f456447b74450137b1e029f6c2fb3b1ba5e9c8693a513f5ed6487e87a59de08b34d2c39fd6b6017ec786646', 'DlKcgtdWYKhSR8Fsosks', '0e5f6f30baa123a84021fceab8cb69bc7e9251d828da3c4797c0b34a0120d08adefbe8177a936bb3228c99f72e452045e9801e7a04f34f584be7b215990a3677', 'An new adventurer to the city of Barcelona!', '/images/anon.png', '2011-05-30 11:01:31.550756', '2011-05-30 11:01:31.550756', NULL, NULL)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "bio" = 'The codemonkey in charge of this project. This is also the example profile page, complete with silly bio and (eventually) a profile picture.
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])