app/controllers/badges_controller.rb

  def index
    @badges = Badge.all
---
SELECT "badges".* FROM "badges"

  def show
    @badge = Badge.find(params[:id])
---
SELECT "badges".* FROM "badges" WHERE "badges"."id" = 1 LIMIT 1

  def create
    @badge = Badge.new(params[:badge])

    respond_to do |format|
      if @badge.save
---
INSERT INTO "badges" ("name", "description", "uid", "imageurl", "created_at", "updated_at") VALUES ('Example', 'Example badge. Earned by no one', NULL, 'images/rails.png', '2011-05-24 19:52:48.503035', '2011-05-24 19:52:48.503035')