app/controllers/locations_controller.rb

  def show
    @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 1 LIMIT 1

  def edit
    @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 1 LIMIT 1

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("name", "mapurl", "description", "tips", "nearby", "uid", "created_at", "updated_at") VALUES ('Arc De Triomf', 'images/arc.jpg', 'The Arc de Triomf was built for the Exposición Universal de Barcelona in 1888.', 'Nothing so far', 'Temporary text', '1', '2011-05-24 11:52:47.621916', '2011-05-24 11:52:47.621916')

  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 1 LIMIT 1
UPDATE "locations" SET "mapurl" = 'images/rails.png', "updated_at" = '2011-05-25 20:29:57.464082' WHERE "locations"."id" = 1